In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-03  0.843224  0.432415 -0.270063 -0.761962
2013-01-04  2.432998 -0.567433  0.256101 -1.318619
2013-01-05 -1.093729 -0.635512  0.254884  0.142275
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999

In [9]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [10]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-03  0.843224  0.432415 -0.270063 -0.761962
2013-01-04  2.432998 -0.567433  0.256101 -1.318619
2013-01-05 -1.093729 -0.635512  0.254884  0.142275

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[-0.54458078,  0.19420914, -0.76604074, -0.91286385],
       [-0.98307843, -0.12704379,  1.37198332,  0.04413078],
       [ 0.84322441,  0.43241457, -0.27006283, -0.76196232],
       [ 2.43299811, -0.56743323,  0.25610083, -1.31861871],
       [-1.0937293 , -0.63551207,  0.25488439,  0.14227498],
       [-2.59102424, -0.28599358, -0.15040726,  0.09599867]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.322698 -0.164893  0.116076 -0.451840
std    1.742318  0.420797  0.723108  0.625957
min   -2.591024 -0.635512 -0.766041 -1.318619
25%   -1.066067 -0.497073 -0.240149 -0.875138
50%   -0.763830 -0.206519  0.052239 -0.358916
75%    0.496273  0.113896  0.255797  0.083032
max    2.432998  0.432415  1.371983  0.142275

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.544581   -0.983078    0.843224    2.432998   -1.093729   -2.591024
B    0.194209   -0.127044    0.432415   -0.567433   -0.635512   -0.285994
C   -0.766041    1.371983   -0.270063    0.256101    0.254884   -0.150407
D   -0.912864    0.044131   -0.761962   -1.318619    0.142275    0.095999

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.912864 -0.766041  0.194209 -0.544581
2013-01-02  0.044131  1.371983 -0.127044 -0.983078
2013-01-03 -0.761962 -0.270063  0.432415  0.843224
2013-01-04 -1.318619  0.256101 -0.567433  2.432998
2013-01-05  0.142275  0.254884 -0.635512 -1.093729
2013-01-06  0.095999 -0.150407 -0.285994 -2.591024

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -1.093729 -0.635512  0.254884  0.142275
2013-01-04  2.432998 -0.567433  0.256101 -1.318619
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864
2013-01-03  0.843224  0.432415 -0.270063 -0.761962

In [20]:
df['A'] #select a single column

2013-01-01   -0.544581
2013-01-02   -0.983078
2013-01-03    0.843224
2013-01-04    2.432998
2013-01-05   -1.093729
2013-01-06   -2.591024
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3] #slices along the rows

                   A         B         C         D
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-03  0.843224  0.432415 -0.270063 -0.761962

In [22]:
df['20130102':'20130104'] #slices among rows again

                   A         B         C         D
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-03  0.843224  0.432415 -0.270063 -0.761962
2013-01-04  2.432998 -0.567433  0.256101 -1.318619

In [23]:
df.loc[dates[0]] #selection by label

A   -0.544581
B    0.194209
C   -0.766041
D   -0.912864
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']] #electing on a multi-axis by label

                   A         B
2013-01-01 -0.544581  0.194209
2013-01-02 -0.983078 -0.127044
2013-01-03  0.843224  0.432415
2013-01-04  2.432998 -0.567433
2013-01-05 -1.093729 -0.635512
2013-01-06 -2.591024 -0.285994

In [25]:
df.loc['20130102':'20130104',['A','B']] #Showing label slicing, both endpoints are included

                   A         B
2013-01-02 -0.983078 -0.127044
2013-01-03  0.843224  0.432415
2013-01-04  2.432998 -0.567433

In [26]:
df.loc['20130102',['A','B']] #Reduction in the dimensions of the returned object

A   -0.983078
B   -0.127044
Name: 2013-01-02 00:00:00, dtype: float64

In [27]:
df.loc[dates[0],'A'] #for getting a scalar value

-0.54458077533243066

In [28]:
df.at[dates[0],'A'] #For getting fast access to a scalar (equiv to the prior method)

-0.54458077533243066

In [29]:
#selection by position
df.iloc[3] #Select via the position of the passed integers

A    2.432998
B   -0.567433
C    0.256101
D   -1.318619
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5,0:2] #By integer slices, acting similar to numpy/python

                   A         B
2013-01-04  2.432998 -0.567433
2013-01-05 -1.093729 -0.635512

In [31]:
df.iloc[[1,2,4],[0,2]] #By lists of integer position locations, similar to the numpy/python style

                   A         C
2013-01-02 -0.983078  1.371983
2013-01-03  0.843224 -0.270063
2013-01-05 -1.093729  0.254884

In [32]:
df.iloc[1:3,:] #For slicing rows explicitly

                   A         B         C         D
2013-01-02 -0.983078 -0.127044  1.371983  0.044131
2013-01-03  0.843224  0.432415 -0.270063 -0.761962

In [33]:
df.iloc[:,1:3] #For slicing columns explicitly

                   B         C
2013-01-01  0.194209 -0.766041
2013-01-02 -0.127044  1.371983
2013-01-03  0.432415 -0.270063
2013-01-04 -0.567433  0.256101
2013-01-05 -0.635512  0.254884
2013-01-06 -0.285994 -0.150407

In [34]:
df.iloc[1,1] #for getting a value explicitly

-0.12704379360330448

In [35]:
df.iat[1,1] #For getting fast access to a scalar (equiv to the prior method)

-0.12704379360330448

In [36]:
#boolean indexing
df[df.A > 0] #Using a single column’s values to select data.

                   A         B         C         D
2013-01-03  0.843224  0.432415 -0.270063 -0.761962
2013-01-04  2.432998 -0.567433  0.256101 -1.318619

In [37]:
df[df > 0] #a where operation for getting

                   A         B         C         D
2013-01-01       NaN  0.194209       NaN       NaN
2013-01-02       NaN       NaN  1.371983  0.044131
2013-01-03  0.843224  0.432415       NaN       NaN
2013-01-04  2.432998       NaN  0.256101       NaN
2013-01-05       NaN       NaN  0.254884  0.142275
2013-01-06       NaN       NaN       NaN  0.095999

In [38]:
#Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864    one
2013-01-02 -0.983078 -0.127044  1.371983  0.044131    one
2013-01-03  0.843224  0.432415 -0.270063 -0.761962    two
2013-01-04  2.432998 -0.567433  0.256101 -1.318619  three
2013-01-05 -1.093729 -0.635512  0.254884  0.142275   four
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999  three

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.843224  0.432415 -0.270063 -0.761962   two
2013-01-05 -1.093729 -0.635512  0.254884  0.142275  four

In [40]:
#Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1
df

                   A         B         C         D   F
2013-01-01 -0.544581  0.194209 -0.766041 -0.912864 NaN
2013-01-02 -0.983078 -0.127044  1.371983  0.044131   1
2013-01-03  0.843224  0.432415 -0.270063 -0.761962   2
2013-01-04  2.432998 -0.567433  0.256101 -1.318619   3
2013-01-05 -1.093729 -0.635512  0.254884  0.142275   4
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999   5

In [42]:
#Setting values by label
df.at[dates[0],'A'] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.194209 -0.766041 -0.912864 NaN
2013-01-02 -0.983078 -0.127044  1.371983  0.044131   1
2013-01-03  0.843224  0.432415 -0.270063 -0.761962   2
2013-01-04  2.432998 -0.567433  0.256101 -1.318619   3
2013-01-05 -1.093729 -0.635512  0.254884  0.142275   4
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999   5

In [43]:
#Setting values by position
df.iat[0,1] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000 -0.766041 -0.912864 NaN
2013-01-02 -0.983078 -0.127044  1.371983  0.044131   1
2013-01-03  0.843224  0.432415 -0.270063 -0.761962   2
2013-01-04  2.432998 -0.567433  0.256101 -1.318619   3
2013-01-05 -1.093729 -0.635512  0.254884  0.142275   4
2013-01-06 -2.591024 -0.285994 -0.150407  0.095999   5

In [44]:
#Setting by assigning with a numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.766041  5 NaN
2013-01-02 -0.983078 -0.127044  1.371983  5   1
2013-01-03  0.843224  0.432415 -0.270063  5   2
2013-01-04  2.432998 -0.567433  0.256101  5   3
2013-01-05 -1.093729 -0.635512  0.254884  5   4
2013-01-06 -2.591024 -0.285994 -0.150407  5   5

In [45]:
#A where operation with setting.
df2 = df.copy()
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.766041  5 NaN
2013-01-02 -0.983078 -0.127044  1.371983  5   1
2013-01-03  0.843224  0.432415 -0.270063  5   2
2013-01-04  2.432998 -0.567433  0.256101  5   3
2013-01-05 -1.093729 -0.635512  0.254884  5   4
2013-01-06 -2.591024 -0.285994 -0.150407  5   5

df2[df2 > 0] = -df2
df2

In [47]:
#missing data
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.766041  5 NaN   1
2013-01-02 -0.983078 -0.127044  1.371983  5   1   1
2013-01-03  0.843224  0.432415 -0.270063  5   2 NaN
2013-01-04  2.432998 -0.567433  0.256101  5   3 NaN

In [48]:
#To drop any rows that have missing data.
df1.dropna(how='any') #all that's left is this one row

                   A         B         C  D  F  E
2013-01-02 -0.983078 -0.127044  1.371983  5  1  1

In [49]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -0.766041  5  5  1
2013-01-02 -0.983078 -0.127044  1.371983  5  1  1
2013-01-03  0.843224  0.432415 -0.270063  5  2  5
2013-01-04  2.432998 -0.567433  0.256101  5  3  5

In [50]:
#To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [ ]:
#operations